Мобилка_серверная/src/Catalogs/ТестированиеИнтентов/ТестированиеИнтентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТестированиеИнтентов</name>
  <attributes>
    <name>Действие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Данные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДопДанные</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипAndroid</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Мобилка_серверная/src/Catalogs/ТестированиеИнтентов/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ВыполнитьИнтент(Команда)

	#Если МобильноеПриложениеКлиент Тогда
	НовВз = Новый ЗапускПриложенияМобильногоУстройства;
	ЗаполнитьЗначенияСвойств(НовВз, Объект);
	Для Каждого Стр Из Объект.ДопДанные Цикл
		НовВз.ДополнительныеДанные.Добавить(Стр.Имя, Стр.Значение, Строка(Стр.Тип));
	КонецЦикла;
	
	Результат = НовВз.Запустить(Истина);
	Данные = НовВз.Данные;
	ДопДанныеРезультат.Очистить();
	Для Каждого Стр Из НовВз.ДополнительныеДанные Цикл
		Нов = ДопДанныеРезультат.Добавить();
		Нов.Имя = Стр.Ключ;
		Нов.Значение = Стр.Значение;
		Нов.ТипДанных = Стр.ИмяТипа;
	КонецЦикла;
	Элементы.Группа1.ТекущаяСтраница = Элементы.Результат;
	#КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.Справка Тогда
		ЗагрузкаСправки();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗагрузкаСправки()
	
	Объект.URL = "http://developer.android.com/intl/ru/tools/sdk/tools-notes.html#q="+Объект.Действие;
	
КонецПроцедуры
